Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рестораны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ресторан</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АутентификацияСтандартная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыИнформационныхКарт</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрационная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыИнформационныхКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИнформационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ИнформационныеКарты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адресс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Comment>Дата выдачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Comment>Дата изъятия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Дата регистрации в системе</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГендернаяПринадлежность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееПоздравление</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентУточняемый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЧленыСемьи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи/Forms/ФормаНастройкиГруппыПользователя/Ext/Form/Module.bsl
&НаКлиенте
Процедура АутентификацияСтандартнаяПриИзменении(Элемент)

	АутентификацияСтандартная = (ТипРегистрации = "Стандартная");
	
	Если (ТипРегистрации = "Карта") Тогда
		Элементы.ГруппаРегистрация.ТекущаяСтраница = Элементы.ГруппаРегистрацияКодКарты;
	Иначе
		Элементы.ГруппаРегистрация.ТекущаяСтраница = Элементы.ГруппаРегистрацияПароль;
	КонецЕсли; 
	
КонецПроцедуры // АутентификацияСтандартнаяПриИзменении();

&НаКлиенте
Процедура ГруппаПользователейОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // ГруппаПользователейОчистка()

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	ПодтверждениеПароляПриИзменении(Элемент);
	
	ПарольПриИзмененииНаСервере();
	
КонецПроцедуры // ПарольПриИзменении()

&НаСервере
Процедура ПарольПриИзмененииНаСервере()
	
	ПарольНеУникальный = Ложь;
	
	Если ЗначениеЗаполнено(Пароль) Тогда
		
		// В пределах набора записей.
		Для Каждого СтрокаГруппыПользователей Из Параметры.ГруппыПользователей Цикл
			Если (Пароль = СтрокаГруппыПользователей.Пароль) И (Не ГруппаПользователей = СтрокаГруппыПользователей.ГруппаПользователей) Тогда
				ПарольНеУникальный = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	
		// В регистре.
		Если Не ПарольНеУникальный Тогда
			УстановитьПривилегированныйРежим(Истина);
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ГруппыПользователей.Пользователь
			                      |ИЗ
			                      |	РегистрСведений.ГруппыПользователей КАК ГруппыПользователей
			                      |ГДЕ
			                      |	НЕ ГруппыПользователей.Пользователь = &Пользователь
			                      |	И ГруппыПользователей.Пароль = &Пароль");
			Запрос.УстановитьПараметр("Пользователь", Параметры.Пользователь);
			Запрос.УстановитьПараметр("Пароль", Пароль);
			
			ПарольНеУникальный = Не Запрос.Выполнить().Пустой();
			
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ПарольНеУникальный Тогда
		Элементы.ДекорацияПарольНеУникальный.Заголовок = НСтр("ru = '(не уникальный)'; uk = '(не унікальний)'");
	Иначе
		Элементы.ДекорацияПарольНеУникальный.Заголовок = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры // ПарольПриИзмененииНаСервере()

&НаКлиенте
Процедура ПодтверждениеПароляПриИзменении(Элемент)
	
	ПаролиНеСовпадают = (Не Пароль = ПодтверждениеПароля);
	
	Если ПаролиНеСовпадают Тогда
		Элементы.ДекорацияНадписьНеСовпадают.Заголовок = НСтр("ru = '(не совпадают)'; uk = '(не співпадають)'");
	Иначе
		Элементы.ДекорацияНадписьНеСовпадают.Заголовок = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры // ПодтверждениеПароляПриИзменении()

&НаСервере
Процедура ПодтверждениеПароляПриИзмененииНаСервере()
	
	ПаролиНеСовпадают = (Не Пароль = ПодтверждениеПароля);
	
	Если ПаролиНеСовпадают Тогда
		Элементы.ДекорацияНадписьНеСовпадают.Заголовок = НСтр("ru = '(не совпадают)'; uk = '(не співпадають)'");
	Иначе
		Элементы.ДекорацияНадписьНеСовпадают.Заголовок = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры // ПодтверждениеПароляПриИзмененииНаСервере()

&НаКлиенте
Процедура КодКартыПриИзменении(Элемент)
	
	КодКартыПриИзмененииНаСервере();
	
КонецПроцедуры // КодКартыПриИзменении()

&НаСервере
Процедура КодКартыПриИзмененииНаСервере()
	
	КартаДисконтная = Ложь;
	
	Если Не ПустаяСтрока(КодКарты) Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	ИнформационныеКарты.ВидКарты,
		                      |	ИнформационныеКарты.ТипКарты
		                      |ИЗ
		                      |	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
		                      |ГДЕ
		                      |	ИнформационныеКарты.КодКарты = &КодКарты
		                      |	И ИнформационныеКарты.ТипКарты = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхКарт.Дисконтная)");
		Запрос.УстановитьПараметр("КодКарты", КодКарты);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			КартаДисконтная = (Выборка.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная);
			КартаДисконтная = Выборка.ВидКарты;
		Иначе
			КартаДисконтная = Ложь;
		КонецЕсли; 
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
	Если КартаДисконтная Тогда
		Элементы.ДекорацияКодКартыДисконтная.Заголовок = НСтр("ru = '(дисконтная карта)'; uk = '(дисконтна карта)'");
	Иначе
		Элементы.ДекорацияКодКартыДисконтная.Заголовок = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры // КодКартыПриИзмененииНаСервере()

&НаКлиенте
Процедура КодКартыАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Текст) Тогда
		КодКартыАвтоПодборНаСервере(Текст, ДанныеВыбора);
		СтандартнаяОбработка = (ДанныеВыбора = Неопределено);
	КонецЕсли; 
	
КонецПроцедуры // КодКартыАвтоПодбор()

&НаСервереБезКонтекста
Процедура КодКартыАвтоПодборНаСервере(Текст, ДанныеВыбора)

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 51
	                      |	ИнформационныеКарты.КодКарты КАК КодКарты,
	                      |	ИнформационныеКарты.ВладелецКарты,
	                      |	ИнформационныеКарты.ВладелецКарты.Наименование КАК Владелец
	                      |ИЗ
	                      |	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
	                      |ГДЕ
	                      |	ИнформационныеКарты.КодКарты ПОДОБНО &КодКарты
	                      |	И ИнформационныеКарты.ТипКарты = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхКарт.Регистрационная)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КодКарты");
	//.. Начало изменения Dim)on  10 октября 2013 г. 16:39:13
	//
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИнформационныеКарты.ТипКарты = ЗНАЧЕНИЕ(Перечисление.ТипыИнформационныхКарт.Регистрационная)", "");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИнформационныеКарты", "РегистрационныеКарты");
	//
	//.. Конец изменения Dim)on  10 октября 2013 г. 16:39:13
	Запрос.УстановитьПараметр("КодКарты", Текст + "%");
	
	РегистрационныеКарты = Запрос.Выполнить().Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РегистрационныеКарты.Количество() И (РегистрационныеКарты.Количество() <= 50) Тогда
		ДанныеВыбора = Новый СписокЗначений;
		
		Для Каждого РегистрационнаяКарта Из РегистрационныеКарты  Цикл
			Если ЗначениеЗаполнено(РегистрационнаяКарта.ВладелецКарты) Тогда
				ДанныеВыбора.Добавить(РегистрационнаяКарта.КодКарты, РегистрационнаяКарта.КодКарты + " (" + РегистрационнаяКарта.Владелец + ")"); 
			Иначе
				ДанныеВыбора.Добавить(РегистрационнаяКарта.КодКарты, РегистрационнаяКарта.КодКарты); 
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры // КодКартыАвтоПодборНаСервере()

&НаКлиенте
Процедура ВидКартыПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ВидКарты) Тогда
		ВидКарты = ПредопределенноеЗначение("Перечисление.ВидыИнформационныхКарт.Магнитная");
	КонецЕсли; 
	
КонецПроцедуры // ВидКартыПриИзменении()


&НаКлиенте
Процедура OK(Команда)
	
	ОчиститьСообщения();

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли; 
	
	// Данные.
	ЗаполнитьЗначенияСвойств(Параметры.СтрокаГруппыПользователей, ЭтаФорма);
	
	Если (ТипРегистрации = "Стандартная") Тогда
		Параметры.СтрокаГруппыПользователей.Вставить("ИндексКартинки", 0);
		Параметры.СтрокаГруппыПользователей.КодКарты = Неопределено;
	КонецЕсли; 
	Если (ТипРегистрации = "Дополнительная") Тогда
		Параметры.СтрокаГруппыПользователей.Вставить("ИндексКартинки", 1);
		Параметры.СтрокаГруппыПользователей.КодКарты = Неопределено;
	КонецЕсли; 
	Если (ТипРегистрации = "Карта") Тогда
		Параметры.СтрокаГруппыПользователей.Вставить("ИндексКартинки", 2);
		Параметры.СтрокаГруппыПользователей.Пароль = Неопределено;
	КонецЕсли; 
	
	Закрыть(Параметры.СтрокаГруппыПользователей);
	
КонецПроцедуры // OK()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Данные.
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.СтрокаГруппыПользователей);
	ГруппаПользователей = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(ГруппаПользователей, Справочники.ГруппыПользователей.ОсновнаяГруппаПользователей());
	ПодтверждениеПароля = Пароль;
	
	// Настройка формы.
	Элементы.ГруппаАутентификацияСтандартная.Видимость = Параметры.СтрокаГруппыПользователей.АутентификацияСтандартная Или 
													     (Не Параметры.ГруппыПользователей.НайтиСтроки(Новый Структура("АутентификацияСтандартная", Истина)).Количество());
	Элементы.ГруппаАутентификацияДополнительная.Видимость = Не Элементы.ГруппаАутентификацияСтандартная.Видимость;
	
	Если (ТипРегистрации = "Карта") Тогда
		Элементы.ГруппаРегистрация.ТекущаяСтраница = Элементы.ГруппаРегистрацияКодКарты;
	Иначе
		Элементы.ГруппаРегистрация.ТекущаяСтраница = Элементы.ГруппаРегистрацияПароль;
	КонецЕсли; 
	
	ПарольПриИзмененииНаСервере();													 
	ПодтверждениеПароляПриИзмененииНаСервере();													 
	КодКартыПриИзмененииНаСервере();													 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	АутентификацияСтандартная = (ТипРегистрации = "Стандартная");
	
	Если (ТипРегистрации = "Карта") Тогда
		__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "Пароль,ПодтверждениеПароля");
		
		Если КартаДисконтная Тогда
			__ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru = 'Код принадлежит дисконтной карте'; uk = 'Код належить дисконтній картці'"), ,, "КодКарты", Отказ);
		КонецЕсли; 
	Иначе
		__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "КодКарты,ВидКарты");
		
		Если АутентификацияСтандартная Тогда
			__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "Пароль,ПодтверждениеПароля");
		Иначе
			Если ПарольНеУникальный Тогда
				__ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru = 'Пароль не уникальный'; uk = 'Пароль не унікальний'"), ,, "Пароль", Отказ);
			КонецЕсли; 
		КонецЕсли; 
		
		Если ПаролиНеСовпадают Тогда
			__ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru = 'Пароль и подтверждение пароля не совпадают'; uk = 'Пароль і підтвердження пароля не співпадають'"), ,, "ПодтверждениеПароля", Отказ);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()
